-- event_header.lua
-- 2018-04-30
-- xzc

--@class EvObj 事件定义
--@field i number 事件id
--@field w table 转发的worker列表，如 {i = 1, w = {W.GAME}}

EV ={
    -- 玩家事件定义
    INIT    = {i = 1}, -- 所有模块数据加载完成，开始初始化，此事件不可发送协议
    LOGIN   = {i = 2}, -- 登录游戏，同步数据到客户端，镜像不触发此事件
    LOGOUT  = {i = 3}, -- 退出游戏
    LOADING = {i = 4}, -- 数据加载中，需要加载数据的模块可以在此事件加载
    SAVE    = {i = 5}, -- 定时保存数据

-- /////////////////////////////////////////////////////////////////////////////
-- 1024以上为系统事件////////////////////////////////////////////////////////////
-- /////////////////////////////////////////////////////////////////////////////

    -- 系统事件定义
    READY                = {i = 1025}, -- 系统初始化完成
    SCRIPT_LOADED        = {i = 1026}, -- 脚本加载完成，热更也会触发
    WORKER_START         = {i = 1027}, -- [worker地址][worker]worker启动，但尚未初始化完成
    WORKER_OTHER_READY   = {i = 1028}, -- 触发事件的worker启动完成收到事件的worker可能未启动完成
    WORKER_BOTH_READY    = {i = 1029}, -- 触发事件、接受事件的双方都启动完成
    WORKER_STOP          = {i = 1030}, -- [worker地址][worker]worker停止
    SEC_TIMER            = {i = 1031}, -- [当前时间戳]定时器，每秒触发一次
    MIN_TIMER            = {i = 1032}, -- [当前时间戳]定时器，每分钟触发一次，在每分钟0秒时触发
}
